{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "ronnie.fyi",
  "language": "en",
  "home_page_url": "https://ronnie.fyi/",
  "feed_url": "https://ronnie.fyi/feed/feed.json",
  "description": "Hello and welcome",
  "author": {
    "name": "Ronnie Brown",
    "url": "https://ronnie.fyi/about-me/"
  },
  "items": [{
      "id": "https://ronnie.fyi/posts/annual-do-better-post/",
      "url": "https://ronnie.fyi/posts/annual-do-better-post/",
      "title": "My Annual &quot;Do Better&quot; Post",
      "content_html": "<p>I post to here so infrequently that I've forgotten how to do it. This is essentially a test of the system. In case it works, I might as well write something:</p>\n<p>In some downtime over the festive period - I haven't had much, as you can imagine - I've been playing around with <a href=\"https://astro.build/\">Astro</a>, <a href=\"https://www.storyblok.com/\">Storyblok</a> and (separately), dipping into some <a href=\"https://developer.wordpress.org/\">WordPress theme development</a> for the first time in ages. More of the same this year, is the plan.</p>\n<p>I've been asked to build a couple of sites and I'm trying to figure out which is the best for all parties. That is, what's easiest to update for the client, and for me to build. Right now, that's probably WordPress but I'll see how I get on.</p>\n",
      "date_published": "2024-01-04T12:00:00Z"
    },{
      "id": "https://ronnie.fyi/posts/spotify-dj/",
      "url": "https://ronnie.fyi/posts/spotify-dj/",
      "title": "Spotify DJ",
      "content_html": "<p>Spotify's new AI DJ is awful.</p>\n<p>That is all.</p>\n",
      "date_published": "2023-08-13T00:00:00Z"
    },{
      "id": "https://ronnie.fyi/posts/who-dis/",
      "url": "https://ronnie.fyi/posts/who-dis/",
      "title": "Who dis?",
      "content_html": "<p>It must be something about the month of March. Last time I posted was 368 days ago.</p>\n<p>It's been a busy year. Work mainly, but life gets in the way, too.</p>\n<p>I'm back at the keyboard doing some development hings. Updated this site to React the other day: <a href=\"https://howmanytitleshaverangerswon.co.uk/\">How Many Titles Have Rangers Won?</a> and set it up with Netlify. For no other reason than, because.</p>\n<p>Anyway, more to come. Hopefully. And on this site, too. It needs some pzazz.</p>\n",
      "date_published": "2023-03-15T00:22:28Z"
    },{
      "id": "https://ronnie.fyi/posts/sk8er-boi/",
      "url": "https://ronnie.fyi/posts/sk8er-boi/",
      "title": "Sk8er Boi",
      "content_html": "<p>While I was away, it was my daughter's 9th birthday. In the run up to the big day, she made it clear that she wanted a skateboard but - and I didn't need much convincing - I had to get one, too. She's obviously heard about my amazing skating skills.</p>\n<p>For some reason, she has it in her head that I can teach her. Well, a few YouTube videos later (mainly, <a href=\"https://www.youtube.com/playlist?list=PL34F060CE1BA3E968\">Braille Skateboarding's Learn to Skateboard</a> videos) I think I can at least show her how to ride it.</p>\n<p>I skated a bit as a teenager, but nothing more than being relatively comfortable on the board, and being able to do a passable ollie. But now I'm a 45-year-old sk8er boi and I'm here for it.</p>\n<p>Here's what I bought myself.</p>\n<p><img src=\"https://ronnie.fyi/img/birdhouse.jpg\" alt=\"My new Birdhouse skateboard\" title=\"A picture of a Birdhouse-branded skateboard\" /></p>\n<p>I've already swapped out the bearings and replaced the wheels with something a bit bigger and softer to deal with the crappy pavements around my way.</p>\n<p>I'll be sure to let you know when I make my first trip to casualty with a broken collar bone.</p>\n<p>In the meantime, here's some Avril Lavigne.</p>\n<iframe width=\"600\" height=\"450\" src=\"https://www.youtube.com/embed/TIy3n2b7V9k\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n",
      "date_published": "2022-03-12T00:07:00Z"
    },{
      "id": "https://ronnie.fyi/posts/branding/",
      "url": "https://ronnie.fyi/posts/branding/",
      "title": "Branding",
      "content_html": "<p>I've been away for a bit. Sorry about that. In the meantime, here's some site branding I've been working on. Any thoughts, send them to me on Twitter <a href=\"https://twitter.com/rnnbrwn\">@rnnbrwn</a></p>\n<p><img src=\"https://ronnie.fyi/img/branding-work-in-progress.png\" alt=\"Site branding concepts for ronnie.fyi\" title=\"Three coloured &quot;r&quot; logos for ronnie.fyi\" /></p>\n<p>I played around with some pinks and yellows before settling on a blue that I liked for a full colour variant. Below that are a more minimal light-on-dark and and dark-on-light variant.</p>\n<p>Next thing to do is to start building out v1 of this site, with colours and branding. Future Ronnie says he'll do that.</p>\n",
      "date_published": "2022-03-11T21:54:00Z"
    },{
      "id": "https://ronnie.fyi/posts/digital-comic-art/",
      "url": "https://ronnie.fyi/posts/digital-comic-art/",
      "title": "Digital Comic Art — An Introduction",
      "content_html": "<p>Late last year, I found an art class I was interested in attending, being held at the <a href=\"https://www.cityofglasgowcollege.ac.uk/\">City of Glasgow College</a>. It was to be taught by <a href=\"https://www.instagram.com/macewan_/\">Russell MacEwan</a>, so I gave him a quick Google to find out more, and became an immediate fan of his work.</p>\n<p>Unfortunately, due to Covid, the class was moved from in-person to online, meaning a weekly Zoom call with Russell and my fellow students. Tonight was the first class, an introduction to the following six weeks. During the three hours, we discussed drawing lines, mass, and form; we were encouraged to spend time learning the human figure, to study comics, and to draw from life; and we spent some time drawing thumbnail sketches of some comic book panels we had to hand.</p>\n<p>I have a few sketches from the evening, but two of my favourites are these thumbnail sketches, both of which were done within a couple of minutes, and were inspired by (1) IDP: 2043; and (2) <a href=\"https://en.wikipedia.org/wiki/Superman:_Red_Son\">Superman: Red Son</a>.</p>\n<p><img src=\"https://ronnie.fyi/img/idp-2043-thumbnail.jpg\" alt=\"An image showing a panel from a comic book, and my attempt to replicate it\" title=\"IDP: 2043, original artwork by Dan McDaid\" /></p>\n<p><img src=\"https://ronnie.fyi/img/superman-red-son-thumbnail-1.jpg\" alt=\"An image showing a sketch of two figures facing away from each other\" title=\"Superman: Red Son, thumbnail sketch by me\" /></p>\n<p><img src=\"https://ronnie.fyi/img/superman-red-son-thumbnail-2.jpg\" alt=\"An image showing a panel from a comic book, and my attempt to replicate it\" title=\"Superman: Red Son, original artwork by Johnson/Plunkett/Robinson/Wong\" /></p>\n<p>I was worried that I'd be both the oldest student, and the least talented artist. To be fair, I was probably right, but it was a good mix of ages and skill levels, and it felt like a judgement-free zone.</p>\n<p>I've another 5 weeks of this, and I'm looking forward to (hopefully) seeing some improvement. If there's any to be seen, I'll post it on here!</p>\n<p>All in all, it's not a bad way to spend a Tuesday evening.</p>\n",
      "date_published": "2022-01-18T22:50:00Z"
    },{
      "id": "https://ronnie.fyi/posts/new-year-resolutions/",
      "url": "https://ronnie.fyi/posts/new-year-resolutions/",
      "title": "New Year Resolutions",
      "content_html": "<p>New year resolutions are not usually something in which I invest too much time. Of course, there are the annual <em>lose weight</em> and <em>do more exercise</em> promises that we all make, but other than that, I don't often make it a ritual.</p>\n<p>This year, for a few reasons, I am documenting some things I'd like to achieve, and using this site to mark (hopeful) progress.</p>\n<p>So, without further ado, here we go.</p>\n<h2 id=\"bruidhinn-barrachd-gaidhlig\" tabindex=\"-1\">Bruidhinn barrachd Gàidhlig <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/new-year-resolutions/#bruidhinn-barrachd-gaidhlig\" aria-hidden=\"true\">#</a></h2>\n<p>Or, <em>speak more Gaelic</em>.</p>\n<p>Living in Glasgow, I'm fortunate enough to be able to send my daughter to a bilingual school. <a href=\"https://education.gov.scot/parentzone/my-school/choosing-a-school/gaelic-medium-education/gaelic-medium-education-foghlam-tro-mheadhan-na-gaidhlig/\">Like many others in Scotland</a>, she's being taught in Scots Gaelic, and learning English as a foreign language (although English is our first language in the home). Neither my wife Claire nor I are native Gaelic speakers, so the more I learn, the more integrated within the school community I can be, and the more I can understand my daughter's homework.</p>\n<p>Right now, I'm on a <s>90-day</s> 94-day learning streak on <a href=\"https://www.duolingo.com/enroll/gd/en/Learn-Scottish-Gaelic\">Gaelic Duolingo</a>. Previously, I'd attended some local classes, but Covid put an end to that, so it's Duolingo for now.</p>\n<p><strong>My aim is to achieve a 200-day streak this year</strong>, and to reevaluate if I do so. The 200-day mark is <s>29 April</s> 3 May 2022, so let's check-in then and see how I'm doing. If I fail, there are enough days in the year to re-attempt, at the very least.</p>\n<h2 id=\"build-more-web-sites-(and-learn-more-technologies)\" tabindex=\"-1\">Build more web-sites (and learn more technologies) <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/new-year-resolutions/#build-more-web-sites-(and-learn-more-technologies)\" aria-hidden=\"true\">#</a></h2>\n<p>As previously mentioned, <a href=\"https://ronnie.fyi/posts//a-history-of-web-development\">my web development skills are a <em>wee</em> bit rusty</a>. And, although an enforced absence from work enabled me to sharpen up some areas of note, the technology team of which I am a part subsequently moved towards Hilton's corporate stack, and away from the more <s>YOLO</s> flexible solutions we were previously able to provide.</p>\n<p>In short, we no longer build Wordpress themes for clients, but instead, we have a solution that is tightly integrated with <a href=\"https://www.hilton.com/\">hilton.com</a>, and is built on a JavaScript-centred stack (think: React, Next, Typescript, Tailwind etc.)</p>\n<p>This year, then, I need to engage in a focused period of learning that will get me up-to-speed in that area. Of course, there are work-related items that I will be involved in but, outside of work, I'd like to do some personal learning and <strong>my aim is to build one or two sites that use some or all of the items listed above</strong>.</p>\n<h2 id=\"do-more-art\" tabindex=\"-1\">Do more art <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/new-year-resolutions/#do-more-art\" aria-hidden=\"true\">#</a></h2>\n<h3 id=\"logo-and-illustration-work\" tabindex=\"-1\">Logo and illustration work <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/new-year-resolutions/#logo-and-illustration-work\" aria-hidden=\"true\">#</a></h3>\n<p>While on furlough, I bought myself <a href=\"https://affinity.serif.com/en-gb/designer/\">Serif Affinity Designer</a>. I find it much easier to use than <a href=\"https://www.adobe.com/uk/products/illustrator.html\">Adobe Illustrator</a> (plus it's <em>much</em> less expensive) and I picked up the basics in no time.</p>\n<p>One of the first projects I worked on was to create the logo and branding for <a href=\"https://www.hayfacilities.co.uk/\">Hay Facilities</a>. <em>Note to self: create a projects area to showcase work like this.</em></p>\n<p><img src=\"https://ronnie.fyi/img/hay-facilities-logo.png\" alt=\"Hay Facilities logo\" title=\"Hay Facilities\" /></p>\n<p>At the very least, I'd like to do this for my own site. <strong>My aim, therefore, is to work on at least one more set of logo/brand identities this year, and publish the workings on here.</strong></p>\n<h3 id=\"figures-and-faces\" tabindex=\"-1\">Figures and faces <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/new-year-resolutions/#figures-and-faces\" aria-hidden=\"true\">#</a></h3>\n<p>Just before Covid hit, I was &quot;commissioned&quot; (more like &quot;cajoled&quot;) into creating a piece of art for one of the meeting rooms in what was to become Hilton's new Glasgow office. I finished it, the piece was sent to the printers, and then I was furloughed for 6 months. On my return, I saw for the first time the illustrations I'd created, and I was very pleased with myself.</p>\n<p><img src=\"https://ronnie.fyi/img/the-art-of-the-possible.jpg\" alt=\"A photograph of the wall of a meeting room in the Hilton offices, Glasgow. On the wall, there are lots of small, illustrated robots, and one large robot. On the large robot, it says, 'The Art of the Possible'\" title=\"Art of the Possible robots\" /></p>\n<p>If you follow me on <a href=\"https://instagram.com/rnnbrwn\">Instagram</a>, you might've noticed that I post the odd wee doodle. Nothing much, just wee figures and faces. Well, I'd like to do more like this. More and better.</p>\n<p>I've signed up to a digital illustration course, treated myself to some art supplies over Christmas and we'll see how it goes. I have pretty low expectations, but <strong>my aim is to produce two or three pieces <em>of something</em> that I'm happy with</strong>.</p>\n<h2 id=\"drink-less\" tabindex=\"-1\">Drink less <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/new-year-resolutions/#drink-less\" aria-hidden=\"true\">#</a></h2>\n<p>Alcohol, that is. Water's fine. I'm sure you've heard.</p>\n<p>Hogmanay 2020, peak-Covid (at the time). People gather around laptops to drink alcohol and implant their faces into the homes of their friends.</p>\n<p>At one point during the evening (it was very close to midnight, I remember that much) a friend announced to us all that he was stopping drinking alcohol for the whole of 2021.</p>\n<p>&quot;Aye, right. So you are&quot;, was the unanimous response from his so-called pals. But, to be fair to him, he made it through an entire, pandemic-filled year, without any booze passing his lips.</p>\n<p>Never one to shirk a challenge, even if it is only in my head, I began to think about this a couple of months ago, and I was reminded of <a href=\"https://www.bbc.co.uk/programmes/b0bhkc8b\">Adrian Chiles' BBC documentary &quot;Drinkers Like Me&quot;</a> (available on YouTube, below) in which he described his (and Britain's) attitude to alcohol. In it, he describes himself, not as an alcoholic, but as someone who has an alcohol dependence. This dependence manifested itself in a regular <em>couple of pints after work</em> and then <em>a few cans of beer</em> once he got home, that kind of thing.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/RX2opvj7WE8\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n<p>Through furlough - and beyond, to be honest - I've found it far too easy to reach for a beer or two at the end of the day. My fridge is <em>right next to</em> the dining table that has become a makeshift desk for the past couple of years, which doesn't help. I feel like it's time for that to stop.</p>\n<p><strong>My aim is the same as my friend's: go through a calendar year without drinking any alcohol</strong>. So far so good. As I write this, it's Sunday 9 January 2022, and I've been <em>aff it</em> since 31 December 2021.</p>\n<p>Coming soon: my favourite non-alcoholic beers!</p>\n<h2 id=\"diy-stuff\" tabindex=\"-1\">DIY stuff <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/new-year-resolutions/#diy-stuff\" aria-hidden=\"true\">#</a></h2>\n<p>There's not much to go into here, but over the course of 2022, I plan to</p>\n<ul>\n<li>finish decorating my daughter's bedroom</li>\n<li>make a start on a garden office project</li>\n<li>clear the garage and configure it such that it's an actual, usable space</li>\n</ul>\n<h2 id=\"why-am-i-doing-this\" tabindex=\"-1\">Why am I doing this? <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/new-year-resolutions/#why-am-i-doing-this\" aria-hidden=\"true\">#</a></h2>\n<p>Everything I've written above is for me. It's to keep me focused and to remind me that at the start of the year, there were things that I hoped to achieve. I might check in on them periodically, and I might document progress, challenges etc., but that's all for another time.</p>\n<p><em>Also, lose weight and do more exercise.</em></p>\n",
      "date_published": "2022-01-09T19:15:00Z"
    },{
      "id": "https://ronnie.fyi/posts/continuous-integration/",
      "url": "https://ronnie.fyi/posts/continuous-integration/",
      "title": "Continuous Integration",
      "content_html": "<p>Three posts in and I've already taken a week off from the site!</p>\n<p>Well, that's not strictly true. I've been working (time permitting) on trying to get the site to automatically deploy to my hosting server, from the Github repo in which the code resides. I think I've got it now, so we're cooking with gas from here on out.</p>\n<p>I referenced a few resources when trying to come up with a solution.</p>\n<h2 id=\"watch-and-learn\" tabindex=\"-1\">Watch and Learn <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/continuous-integration/#watch-and-learn\" aria-hidden=\"true\">#</a></h2>\n<p><strong>Deploy To Shared Hosting With Github Actions</strong> from the <strong>Watch and Learn</strong> YouTube channel was my starting point, and from this, I managed (eventually, I had a few problems with Github's secrets) to move code from one place to another.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/UNWIXYSZfZY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n<h2 id=\"tartanllama-and-mfyz\" tabindex=\"-1\">TartanLlama and mfyz <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/continuous-integration/#tartanllama-and-mfyz\" aria-hidden=\"true\">#</a></h2>\n<p>The goto Github Action for building Eleventy seems to be TartanLlama's <a href=\"https://github.com/TartanLlama/actions-eleventy\">action-eleventy</a>, however, I had some problems with its optional inputs, and ended up using a fork of this, by <a href=\"https://github.com/mfyz/actions-eleventy\">mfyz</a>. I'll probably revisit this (as I will with the whole process) because there's no reason TartanLlama's shouldn't work.</p>\n<p>And that's that.</p>\n<p>My <code>yaml</code> file runs whenever anything's pushed to the main branch of the repo, takes a copy of the latest code, builds it using <code>actions-eleventy</code>, and then copies it over to my web host. Decent.</p>\n<p>What I might do is setup a staging repo and sub-domain, in case I want to work on any major changes but, for now, that's good enough for a Saturday night.</p>\n<p>NB I appreciate that there's more to Continuous Integration than just this, calm doon.</p>\n<h2 id=\"update\" tabindex=\"-1\">Update <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/continuous-integration/#update\" aria-hidden=\"true\">#</a></h2>\n<p>Immediately after I posted this, the build/deployment process stopped working. For about an hour I tried a few different things, and then I headed over to the 11ty Discord channel.</p>\n<p>On a Saturday night, a user called <strong>Aankhen</strong> took me through the issue I was having, jumped into my repo and flagged any <code>yaml</code> syntax issues (there were a few!) and basically held my hand as I fixed the problem. What a hero. Here's to you, Aankhen! 🍺</p>\n<h3 id=\"change-to-the-build-process\" tabindex=\"-1\">Change to the build process <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/continuous-integration/#change-to-the-build-process\" aria-hidden=\"true\">#</a></h3>\n<p>As a result of Aankhen's help, I'm no longer using the Action I mentioned above - and I never really needed to - so the process is even simpler now.</p>\n<h2 id=\"resources\" tabindex=\"-1\">Resources <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/continuous-integration/#resources\" aria-hidden=\"true\">#</a></h2>\n<ul>\n<li><a href=\"https://github.com/rnnbrwn/project_ronnie.fyi/blob/main/.github/workflows/build-production.yml\">My build-production.yml</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=UNWIXYSZfZY\">Deploy to Shared Hosting Using Github Actions</a></li>\n<li><a href=\"https://github.com/TartanLlama\">TartanLlama's repo</a></li>\n<li><a href=\"https://github.com/mfyz\">mfyz's repo</a></li>\n<li><a href=\"https://discord.gg/GBkBy9u\">11ty Discord</a></li>\n</ul>\n",
      "date_published": "2022-01-08T20:17:00Z"
    },{
      "id": "https://ronnie.fyi/posts/a-history-of-web-development/",
      "url": "https://ronnie.fyi/posts/a-history-of-web-development/",
      "title": "A History of Web Development",
      "content_html": "<p>My second job out of university was at the long-forgotten, <a href=\"https://en.wikipedia.org/wiki/Compaq\">Compaq</a>. I learned web development on-the-job (pretty much, although my interview did require me to build and present a static landing page for the company), having dabbled in it towards the end of my studies, when the web was still in its infancy. While at Compaq I helped with the creation of the online e-commerce functionality (at a very basic level) and left them to do more creative work.</p>\n<p>My creative juices flowed at several Glasgow-based design agencies, building websites, intranets and focusing on all things digital design. However, Glasgow's creative industry in the early 2000s was pretty unstable and after a couple of years, I headed back into the corporate world.</p>\n<p>I worked for <a href=\"https://www.jpmorgan.com/global\">J.P.Morgan</a> for a couple of years, before their massive expansion in Glasgow, and then took up some more senior roles in local Government. It was here that I gradually began to slip away from the day-to-day workload of creating code and building sites, as I started to manage people and projects.</p>\n<p>In 2015, I took a role at <a href=\"https://www.hilton.com/\">Hilton</a> (after a depressing year commuting to Edinburgh) and continued a trajectory away from writing as much code as I had previously done. It wasn't something I grudged; I was doing a good job, and I enjoyed it. But my web development skills were, by now, seriously eroded.</p>\n<h2 id=\"covid-19\" tabindex=\"-1\">COVID-19 <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/a-history-of-web-development/#covid-19\" aria-hidden=\"true\">#</a></h2>\n<p>In March 2019, I was furloughed from work for an initial period of 3 months (later extended to 6). Between March and September, although I was still employed, I did find myself with some more spare time. So, I focused on regaining some practical, development skills. I built a few sites and made an effort to ensure that when (or if) I returned to Hilton, I did so prepped for what I assumed would be a slightly different work environment.</p>\n<p>Two things about that:</p>\n<ol>\n<li>I wish I'd done more reskilling</li>\n<li>I was fortunate enough to return, and my job has since required me to be more operational, i.e. actually building websites. Here's one I built after my return: <a href=\"https://www.hotelwestminster.co.uk/\">Hotel Westminster</a></li>\n</ol>\n<p>So, here we are. It's been tough year, doing a job that I was once pretty good at, but for which I'm now very rusty. But I've enjoyed building, creating, and being a different member of the team. I've still got lots to learn, though, especially since the team's tech stack is changing (and in some ways has already changed) to a more modern, React-based stack.</p>\n<p>The learning curve is steep, but at least I'm walking uphill.</p>\n",
      "date_published": "2022-01-02T21:41:00Z"
    },{
      "id": "https://ronnie.fyi/posts/about-this-site/",
      "url": "https://ronnie.fyi/posts/about-this-site/",
      "title": "About (this site)",
      "content_html": "<p>&quot;Perfection is the enemy of progress&quot; was said (I think) by Winston Churchill. I think about this <em>a lot</em>. In the case of this site, I'd been sitting on the domain for a while, and trying to determine the best way to build something. To prevent further procrastination, I headed to the <a href=\"https://www.11ty.dev/docs/starter/\">11ty site</a> and forked one of the starter builds, specifically, the <a href=\"https://eleventy-base-blog.netlify.app/\">eleventy base blog</a>.</p>\n<p>I've scratched around with Eleventy a little bit before, and worked on Andy Bell's <strong>Learn Eleventy from Scratch</strong> course (which I really would recommend). It seems like a good, lightweight way of getting a site off the ground, and I was keen to do something different.</p>\n<p>The site's hosted by Dreamhost, and I'm still working in a fairly old-school way of writing a blog post (for example) locally, and punting the output up onto a web server via SFTP. I'll get some keys setup soon enough, so I can do it from the command line - although I'm not as proficient at that as I once was.</p>\n<ul>\n<li><a href=\"https://learneleventyfromscratch.com/\">Learn Eleventy from Scratch</a></li>\n<li><a href=\"https://learneleventyfromscratch.ronnie.fyi/\">The results of the course</a></li>\n</ul>\n",
      "date_published": "2022-01-01T21:00:00Z"
    },{
      "id": "https://ronnie.fyi/posts/slight-return/",
      "url": "https://ronnie.fyi/posts/slight-return/",
      "title": "Slight Return",
      "content_html": "<p>One hundred years ago, I built my first personal website and started blogging. I'm not sure why, but I kinda fell away from it all and focused more on work, than on personal sites and projects.</p>\n<p>But I'm back, with lots of stuff lined up - more on that in another post.</p>\n<h2 id=\"ronnie.fyi\" tabindex=\"-1\">ronnie.fyi <a class=\"direct-link\" href=\"https://ronnie.fyi/posts/slight-return/#ronnie.fyi\" aria-hidden=\"true\">#</a></h2>\n<p>I bought this domain a while back and it's been sitting in cold storage ever since. I'll go into a bit more detail in another post but, over the last year, I've been far more involved in <em>hands-on</em> web development, than I had been for the previous several years. I've even built some sites.</p>\n<ul>\n<li><a href=\"https://mostly.consulting/\">Mostly Consulting</a></li>\n<li><a href=\"https://www.hayfacilities.co.uk/\">Hay Facilities</a></li>\n<li><a href=\"https://samandlaura.wedding/\">Sam &amp; Laura</a></li>\n<li><a href=\"https://www.hotelwestminster.co.uk/\">Hotel Westminster</a></li>\n</ul>\n<p>On top of that, I've started drawing a bit more, too. All of which brings me back to this site. I'm not 100% sure what it'll contain, but I've got a lot of stuff I want to put online, and I don't want to be handing over content to Facebook, Insta, Twitter etc. I've finally come to the conclusion that it's better to host it myself. So here we are.</p>\n<p>&quot;Slight Return&quot; by Bluetones: <a href=\"https://www.youtube.com/watch?v=YeyP2N6glW0\">https://www.youtube.com/watch?v=YeyP2N6glW0</a></p>\n",
      "date_published": "2022-01-01T12:00:00Z"
    }
  ]
}
